---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoofBase
source: html/78dfd771-9fc0-3fd7-a095-8c03e19f5d03.htm
---
# RoofBase Properties

The id of the assembly instance to which the element belongs.